PRAK701/app/Controllers/Auth.php

    public function loginProcess()
    {
        $db = \Config\Database::connect();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $db->table('user')
                   ->where('username', $username)
                   ->orWhere('email', $username)
                   ->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'nabilla'
OR `email` = 'nabilla'