PRAK701/app/Controllers/Buku.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'Login terlebih dahulu!');
            return redirect()->to(base_url('auth'));
        }

        $data['buku'] = $this->bukuModel->findAll();
---
SELECT *
FROM `buku`

            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->bukuModel->save([
            'judul'        => $this->request->getPost('judul'),
            'penulis'      => $this->request->getPost('penulis'),
            'penerbit'     => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('bebas', 'bebas', 'Bebas aja', '2023')

    public function delete($id)
    {
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'Login terlebih dahulu!');
            return redirect()->to(base_url('auth'));
        }

        $this->bukuModel->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('5')

            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->bukuModel->update($id, [
            'judul'        => $this->request->getPost('judul'),
            'penulis'      => $this->request->getPost('penulis'),
            'penerbit'     => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
UPDATE `buku` SET `judul` = '3726 mdpl', `penulis` = 'nda ingat jua', `penerbit` = 'lupa tapi lov lov', `tahun_terbit` = '2023'
WHERE `buku`.`id` IN ('5')